













# False = 0
# 3 Числовые типы данных:
#      a. integer (int) ->Числа с плавающей точной (1.2, 10.20, 2.7)

       #b. floan() ->Числа с плавающей точкой (1.2, 10.20, 2.7,)
       #c. complex() -> комплексные числа (3+5i/j)
# 4.  Списовые  типы данных:
            # a. list(спсок /массив ) -> [1,2,3, True, None]
            # b. truple(кортеж) -Ю (1,2,3,4)
            # c. range (последовательность) -> range(1,5) -> 1,2,3,4
# 5. string(str) строка -> "Hello world"
                        #  'Hello world'
# john = 'my name is Aziyat'     
# 6. set() - Множество
# 7. dict (Словари) -> содержит данные в видеключва: значение -> {1: 'one', 2: 'two'


# ----------------------------------------------------------------------------------------------------------------------------------------

# Mutable (изменяемые типы данных)
# 1. list()
# 2. set()
# 3. dict()

# Immutable (неизменяемые типы )
# 1. None()
# 2. bool()
# 3. int(), float(), complex()
# 4. str()
# 5. range()
# 6. tuple()
# -----------------------------------------------------------------------------------------------------------------------------------------
""" в пайтоне для вывода данных в терминал использюется функция print"""
print ("Hello world my name is Aziyat")
# Стандартный ввод данных
''' Для ввода используется функция input()'''

# input3()

a = input('введите число :')
print (a)

# type () выводит тип данных
print (type (a))

b = int (input ('введите число номер 2:'))
print (type(b))







