GIT - распределенная система конотроля версии (локальная)
Это система для отслеживания и введения истории изменений 





git init - она создает ноы гит репозиторий локально на нашем пк создаст она в той директории где вы запустили 


git add <file name>
git add . -> все в текущей директории

3 git commit - как только мы достигаем определенного момента в разрботке, то мы тогла сохраняем и комментируем все наши изменнения в репозиторий.
(фиксация изменений в репо)
git commit - m'<comment>

4. git remoted add- это команда для того чтобы ваш репощиторий с удаленным репозитерием (репо в гитхабе)

git remote add <название подключения><ссылка на репозиторий>
 git remote add origin <url>
 5. git push - после коммита изменнений при помощи этой команды мы отпраляем наши изменения в файлах 
 
 git push <origin> <название ветки (main)> 

git push origin main 

. 



some text
