GIT - распределенная система конотроля версии (локальная)
Это система для отслеживания и введения истории изменений 





git init - она создает ноы гит репозиторий локально на нашем пк создаст она в той директории где вы запустили 


git add <file name>
git add . -> все в текущей директории

3 git commit - как только мы достигаем определенного момента в разрботке, то мы тогла сохраняем и комментируем все наши изменнения в репозиторий.
(фиксация изменений в репо)
git commit - m'<comment>'

...




